'''
Дан список ["I", "love", "arrays", "they", "are", "my", "favorite"] сделайте из него
строку => "I love arrays they are my favorite"
'''
arr_list = ["I", "love", "arrays", "they", "are", "my", "favorite"]
arr_str = " ".join(arr_list)
# print(type(arr_str)) - Проверка на преоброзование массива в строку
print(arr_str)
