"""Напишите программу, которая добавляет ‘ing’ к словам"""
my_word = input("Enter your word: ")
new_word = my_word + "ing"
print("Your world + ing: ", new_word)
