""" Напишите программу которая удаляет пробел в начале, в конце строки """

my_string = input("Enter your string: ")
string_whithout_spaces = my_string.strip()
print(string_whithout_spaces)
