#1.Заменить символ “#” на символ “/” в строке 'www.my_site.com#about'

str = 'www.my_site.com#about'
print(str.replace('#', '/'))

#2. Напишите программу, которая добавляет ‘ing’ к словам


