# Напишите программу которая удаляет пробел в начале, в конце строки
new = " New str in my Python "
print(new.strip())
