# Написать программу, которая добавляет 'ing' к словам
new_word = input()
print(new_word + "ing")
