'''
Дан список: [‘Ivan’, ‘Ivanou’], и 2 строки: Minsk, Belarus
Напечатайте текст: “Привет, Ivan Ivanou! Добро пожаловать в Minsk Belarus”
'''
list = ["Ivan", "Ivanou"]
string_1 = "Minsk"
string_2 = "Belarus"

print(f"Привет, {list[0]} {list[1]}! Добро пожаловать в {string_1} {string_2}")