# 4.Создайте список из 10 элементов, вставьте на 3-ю позицию новое значение,
# удалите элемент из списка под индексом 6

number_list = [5, 8, 6, 3, 10, 15, 40, 9, 16, 20]
number_list[2] = 18
print(number_list)
del number_list[6]
print(number_list)
