"""Дан список: [‘Ivan’, ‘Ivanou’], и 2 строки: Minsk, Belarus
Напечатайте текст: “Привет, Ivan Ivanou! Добро пожаловать в Minsk Belarus”"""

my_list = ['Ivan', 'Ivanou']
first_string = 'Minsk'
second_string = 'Belarus'
print(f"Привет, {my_list[0]} {my_list[1]}! Добро пожаловать в {first_string} {second_string}")
