# 4.Напишите программу которая удаляет пробел в начале, в конце строки

favorite_language = " Python "
print(f"Before length: ' Python ' - {len(favorite_language)}")
print(f"After length: 'Python' - {len(favorite_language.strip())}")
