# 2.Напишите программу, которая добавляет 'ing' к словам

some_word = 'Hello'
end_word = 'ing'
print(f'Result of sum "{some_word}" and "{end_word}" - {some_word + end_word}')
