# Напишите программу которая удаляет пробел в начале, в конце строки

string = " Python "
print(string.strip())
