# Напишите программу которая удаляет пробел в начале, в конце строки

string = " 1234567 "
print(f'{string[1:8]}')

