# Напишите программу, которая добавляет ‘ing’ к словам

input_word = "python"
end_word = "ing"
print(f'Result of sum "{input_word}" and "{end_word}" is {input_word + end_word}')